docs/comp-sci/theorem-provers/mizar/foundations.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Axiomatic Foundations - Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Axiomatic Foundations - Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-c2f2f1d1-85b8-4681-8e17-f7c769190b7a">1. ZF Axioms in Mizar</a></li>
<li><a href="#h-19880ad7-0dd3-4edc-9499-fa95d9b870f2">2. Soft Types Examples: Subsets</a></li>
</ul>
</div>
</div>
<p>
The foundations of mathematics used by Mizar is actually formalized in a
couple articles in the current MML:
</p>

<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/tarski_0.html"><code>tarski_0</code></a> for the ZF axioms used by Mizar</li>
<li><a href="http://mizar.org/version/current/html/tarski_a.html"><code>tarski_a</code></a> for the axiom stating the existence of a Grothendieck
universe containing a given set</li>
</ul>

<div id="outline-container-h-c2f2f1d1-85b8-4681-8e17-f7c769190b7a" class="outline-2">
<h2 id="h-c2f2f1d1-85b8-4681-8e17-f7c769190b7a"><span class="section-number-2">1.</span> ZF Axioms in Mizar</h2>
<div class="outline-text-2" id="text-h-c2f2f1d1-85b8-4681-8e17-f7c769190b7a">
<p>
The <a href="https://en.wikipedia.org/wiki/Zermelo%E2%80%93Fraenkel_set_theory">ZF axioms</a> contained in Mizar:
</p>

<dl class="org-dl">
<dt><a href="http://mizar.org/version/current/html/tarski_0.html#T2">Extensionality</a></dt><dd>for \(X,Y\) being set st<br>
(for \(x\) being object holds (\(x\in X \iff x\in Y\)))<br>
holds \(X = Y\)</dd>
<dt><a href="http://mizar.org/version/current/html/tarski_0.html#T5">Regularity</a></dt><dd>for \(x_{1}\) being object<br>
for \(X\) being set st \(x_{1}\in X\) holds<br>
exists \(Y\) being set st<br>
(\(Y\in X\) &amp; (for \(x_{2}\) being object holds (\(x_{2}\notin X\) or \(x_{2}\notin Y\))))</dd>
<dt><a href="http://mizar.org/version/current/html/tarski_0.html#T3">Pair</a></dt><dd>for \(X,Y\) being any object<br>
exists \(Z\) being a set such that<br>
for any object \(a\) <br>
holds \(a\in Z\) if and only if \(a=X\) or \(a=Y\).</dd>
<dt><a href="http://mizar.org/version/current/html/tarski_0.html#T4">Union</a></dt><dd>for \(X\) being set<br>
exists \(Z\) being set st<br>
for \(x\) being object holds<br>
(\(x\in Z\) iff exists \(Y\) being set st (\(x\in Y\) &amp; \(Y\in X\)))</dd>
<dt><a href="http://mizar.org/version/current/html/tarski_0.html#S1">Schema of Replacement</a></dt><dd>exists \(X\) being set st<br>
for \(x\) being object holds<br>
(\(x\in X\) iff exists \(y\) being object st (\(y\in F_{1}()\) &amp; \(P_{1}[y,x]\)))<br>
<b>provided</b>
for \(x, y, z\) being object st \(P_{1}[x,y]\) &amp; \(P_{1}[x,z]\) holds \(y = z\)</dd>
</dl>

<div class="remark" id="org37dbff5">
<p>
The axiom of regularity may look a little strange, but remember: if we
have \(\forall X((\exists x, P[x,X])\implies Q[X])\), then this is
logically equivalent to \(\forall X\forall x(P[x,X]\implies Q[X])\).
</p>

</div>

<div class="remark" id="org6e5a0d7">
<p>
The axiom schema of specification can be <a href="https://en.wikipedia.org/wiki/Axiom_schema_of_specification#Relation_to_the_axiom_schema_of_replacement">derived</a> from the schema of
replacement. 
</p>

</div>

<div class="remark" id="org9e270dd">
<p>
Mizar just <i>defines</i> the unordered pair \(\{X,Y\}\) for any \(X\), \(Y\) in
<a href="http://mizar.org/version/current/html/tarski.html#K2"><code>TARSKI:def 2</code></a>&#x2026;but uses the axiom of pairing to justify its existence.
</p>

</div>

<p>
The two missing ZF axioms are the axiom of infinity, and the axiom of
the power set. The power set in Mizar is <code>bool X</code> for \(\mathcal{P}(X)\)
and is defined in <a href="http://mizar.org/version/current/html/zfmisc_1.html#K1"><code>ZFMISC_1:def 1</code></a>, its existence follows from the
Universe axiom.
</p>

<dl class="org-dl">
<dt><a href="http://mizar.org/version/current/html/tarski_a.html#T1">Tarski Universe Axiom</a></dt><dd>for \(N\) being set<br>
exists \(M\) being set st<br>
(\(N\in M\) &amp;<br>
(for \(X\), \(Y\) being set st \(X\in M\) &amp; \(Y\subset X\) holds \(Y\in M\)) &amp;<br>
(for \(X\) being set st \(X\in M\) holds<br>
&emsp; exists \(Z\) being set st<br>
&emsp; (\(Z \in M\) &amp; (for \(Y\) being set st \(Y\subset X\) holds \(Y\in Z\)))) &amp;<br>
 (for \(X\) being set holds (\(X\not\subset M\), or \(X\) and \(M\) are equipotent, or \(X\in M\))))<br></dd>
</dl>

<p>
This gives us the powerset exists (it's the third condition).
</p>

<p>
The generalized axiom of infinity is derived as <a href="http://mizar.org/version/current/html/ordinal1.html#T36"><code>Ordinal_1:Th32</code></a>. Of
course, working our way backwards, this uses Theorem <a href="http://mizar.org/version/current/html/zfmisc_1.html#T112"><code>ZfMisc_1:112</code></a>
which depends on the axiom of the universe.
</p>

<p>
There is also the well-ordering theorem (which Wikipedia includes in the
ZF axioms, but I do not believe it's actually needed &#x2014; it should be
included for ZFC, though). Mizar proves this in
<a href="http://mizar.org/version/current/html/wellord2.html#T17"><code>WELLORD2:Th17</code></a>.
</p>

<p>
Thus Tarski-Grothendieck set theory contains ZF set theory's axioms.
</p>

<p>
Furthermore, the axiom of choice is derived from the axiom of the
universe in <a href="http://mizar.org/version/current/html/wellord2.html#T18"><code>WELLORD2:Th18</code></a>. So really, Tarski-Grothendieck set theory
contains the ZFC axioms.
</p>

<p>
These formed the contents of the first article in <i>Formalized
Mathematics</i>:
</p>

<ul class="org-ul">
<li>Andrzej Trybulec,<br>
"Tarski Grothendieck Set Theory".<br>
<i>Formalized Mathematics</i> <b>1</b>, no.1 (1990) 9&#x2013;11, <a href="http://mizar.org/fm/1990-1/pdf1-1/tarski.pdf">PDF</a>.</li>
</ul>
</div>
</div>




<div id="outline-container-h-19880ad7-0dd3-4edc-9499-fa95d9b870f2" class="outline-2">
<h2 id="h-19880ad7-0dd3-4edc-9499-fa95d9b870f2"><span class="section-number-2">2.</span> Soft Types Examples: Subsets</h2>
<div class="outline-text-2" id="text-h-19880ad7-0dd3-4edc-9499-fa95d9b870f2">
<p>
We have a <i>predicate</i> for \(\subseteq\) encoded in Mizar
<a href="http://mizar.org/version/current/html/tarski.html#R1">TARSKI:def 3</a> as:
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> X, Y <span class="org-mizar-normal">be</span> set;
  <span class="org-mizar-normal">pred</span> X c= Y <span class="org-mizar-normal">means</span> <span class="org-comment-delimiter">:: </span><span class="org-comment">TARSKI:def 3</span>
  <span class="org-mizar-formula">for</span> x <span class="org-mizar-formula">being</span> object <span class="org-mizar-formula">st</span> x in X <span class="org-mizar-formula">holds</span> x in Y;
  <span class="org-mizar-normal">reflexivity</span>;
<span class="org-mizar-block">end</span>; 
</pre>
</div>

<p>
The <i>type</i> for a Subset of \(X\) is defined in <a href="http://mizar.org/version/current/html/subset_1.html#NM2"><code>SUBSET_1</code></a> as
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> X <span class="org-mizar-normal">be</span> set;
  <span class="org-mizar-normal">mode</span> Subset <span class="org-mizar-normal">of</span> X <span class="org-mizar-normal">is</span> Element <span class="org-mizar-normal">of</span> bool X;
<span class="org-mizar-block">end</span>; 
</pre>
</div>

<p>
and <code>bool of X</code> is defined in <a href="http://mizar.org/version/current/html/zfmisc_1.html#K1"><code>ZFMISC_1:def 1</code></a>
as:
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> X <span class="org-mizar-normal">be</span> set ;
  <span class="org-mizar-normal">func</span> bool X -&gt; set <span class="org-mizar-normal">means</span> :Def1: <span class="org-comment-delimiter">:: </span><span class="org-comment">ZFMISC_1:def 1</span>
  <span class="org-mizar-formula">for</span> Z <span class="org-mizar-formula">being</span> set <span class="org-mizar-formula">holds</span>
  (Z in <span class="org-mizar-normal">it</span> <span class="org-mizar-formula">iff</span> Z c= X);
  <span class="org-comment-delimiter">:: </span><span class="org-comment">correctness conditions omitted</span>
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
When we include <code>SUBSET</code> in the requirements directive, Mizar will
automatically infer from <code>X c= Y</code> that <code>X is Subset of Y</code>. If we want to
establish this claim, it amounts to showing for any object <code>x</code> st <code>x in X</code>
we have <code>x in Y</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-08-09 Wed 09:08.</p>
</div>
</body>
</html>